* Setup
- i7 4790k
- Budget SSD

#+BEGIN_SRC sh :results output
uname -a
#+END_SRC

#+RESULTS:
: Linux citadel 6.6.43 #1-NixOS SMP PREEMPT_DYNAMIC Sat Jul 27 09:34:11 UTC 2024 x86_64 GNU/Linux

* Solutions

#+BEGIN_SRC
make <solution>
./<solution> measurements.txt
#+END_SRC

** brc_sequential_read
| Variant           | Run | Time      | Seconds |
|-------------------+-----+-----------+---------|
| BUFFER_SIZE=32MB  |   1 | 3m46.689s | 226.689 |
| BUFFER_SIZE=64MB  |   1 | 3m46.514s | 226.514 |
| BUFFER_SIZE=128MB |   1 | 3m38.165s | 218.165 |
| BUFFER_SIZE=512MB |   1 | 3m47.411s | 227.411 |
#+TBLFM: $4='(+ (string-to-number (car (cdr (split-string $3 "m")))) (* 60 (string-to-number (car (split-string $3 "m")))))

** brc_sequential_mmap
| Variant                    | Run | Time      | Seconds |
|----------------------------+-----+-----------+---------|
| BUFFER_SIZE=4MB            |   1 | 3m25.921s | 205.921 |
| BUFFER_SIZE=4MB, madvise   |   1 | 3m20.333s | 200.333 |
| BUFFER_SIZE=16MB, madvise  |   1 | 3m14.885s | 194.885 |
| BUFFER_SIZE=256MB, madvise |   1 | 3m10.349s | 190.349 |
| BUFFER_SIZE=512MB, madvise |   1 | 3m14.489s | 194.489 |
| BUFFER_SIZE=2GB, madvise   |   1 | 3m17.681s | 197.681 |
#+TBLFM: $4='(+ (string-to-number (car (cdr (split-string $3 "m")))) (* 60 (string-to-number (car (split-string $3 "m")))))

| Variant                  | Run | Time      |            Seconds |  Result |
|--------------------------+-----+-----------+--------------------+---------|
| BUFFER_SIZE=1GB, madvise |   1 | 2m58.482s |            178.482 |         |
| BUFFER_SIZE=1GB, madvise |   2 | 2m57.675s |            177.675 |         |
| BUFFER_SIZE=1GB, madvise |   3 | 2m58.557s | 178.55700000000002 |         |
| BUFFER_SIZE=1GB, madvise |   4 | 2m50.490s |             170.49 |         |
| BUFFER_SIZE=1GB, madvise |   5 | 3m0.369s  |            180.369 | 178.238 |
#+TBLFM: $4='(+ (string-to-number (car (cdr (split-string $3 "m")))) (* 60 (string-to-number (car (split-string $3 "m")))))::@6$5=(vsum(@2$4..@6$4)-vmin(@2$4..@6$4)-vmax(@2$4..@6$4))/3
